Revit 2024 API
Water.WaterBumpAmount Property
 The property labeled "Wave Height" from the "Water" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string WaterBumpAmount { get; }
Visual Basic
Public Shared ReadOnly Property WaterBumpAmount As String
	Get
Visual C++
public:
static property String^ WaterBumpAmount {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 5".
See Also
Water Class
Autodesk.Revit.DB.Visual Namespace